kusadact/STM32-TriPhaseWatch/firmware/board_a/platform/board_a_rtos.c
void BusFault_Handler(void)
{
  board_a_rtos_fatal(BOARD_A_FAULT_BUS_FAULT);
}

void UsageFault_Handler(void)
{
  board_a_rtos_fatal(BOARD_A_FAULT_USAGE_FAULT);
}

static void debug_write_u32(uint32_t value)
{
  char buffer[11];
  uint8_t index = 0U;

  if (value == 0U) {
    debug_uart_putc('0');
    return;
  }

  while (value != 0U) {
    buffer[index] = (char)('0' + (value % 10U));
    value /= 10U;
    index++;
  }
  while (index != 0U) {
    index--;
    debug_uart_putc(buffer[index]);
  }
}

static void timer_init(void)
{
  RCC_ClocksTypeDef clocks;
  TIM_TimeBaseInitTypeDef timer;
  uint32_t timer_clock;
  uint16_t prescaler;

  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
  RCC_GetClocksFreq(&clocks);

  timer_clock = clocks.PCLK1_Frequency;
  if ((RCC->CFGR & RCC_CFGR_PPRE1) != RCC_CFGR_PPRE1_DIV1) {
    timer_clock *= 2U;
  }

  prescaler = (uint16_t)((timer_clock / 1000000U) - 1U);
  TIM_TimeBaseStructInit(&timer);
  timer.TIM_Prescaler = prescaler;
  timer.TIM_CounterMode = TIM_CounterMode_Up;
  timer.TIM_Period = 0xFFFFFFFFU;
  timer.TIM_ClockDivision = TIM_CKD_DIV1;
  timer.TIM_RepetitionCounter = 0U;
  TIM_TimeBaseInit(TIM2, &timer);
  TIM_SetCounter(TIM2, 0U);
  TIM_Cmd(TIM2, ENABLE);

  board_a_monotonic_init(&g_monotonic, TIM2->CNT);
}

static uint64_t board_a_rtos_now_us(void *context)
{
  uint32_t raw_us;
  uint32_t previous_raw_us;
  uint64_t now_us;

  (void)context;
  taskENTER_CRITICAL();
  raw_us = TIM2->CNT;
  previous_raw_us = g_monotonic.last_raw_us;
  if (g_monotonic.initialized &&
      ((uint32_t)(raw_us - previous_raw_us) >
       BOARD_A_MONOTONIC_MAX_GAP_US)) {
    g_board_a_rtos_diag.fault_flags |= BOARD_A_FAULT_MONOTONIC_GAP;
  }
  now_us = board_a_monotonic_update(&g_monotonic, raw_us);
  if (g_monotonic.initialized && (raw_us < previous_raw_us)) {
    g_board_a_rtos_diag.monotonic_wrap_count++;
  }
  taskEXIT_CRITICAL();
  return now_us;
}

uint32_t board_a_rtos_now_ms(void)
{
  (void)board_a_rtos_now_us(NULL);
  return board_a_monotonic_ms(&g_monotonic);
}

static uint64_t sensor_port_now_us(void *context)
{
  (void)context;
  return board_a_rtos_now_us(NULL);
}

static void sensor_port_delay_us(void *context, uint32_t delay_us)
{
  uint64_t started_us;

  (void)context;
  started_us = board_a_rtos_now_us(NULL);
  while ((board_a_rtos_now_us(NULL) - started_us) < delay_us) {
    /* 1-Wire timing is microsecond-scale; keep this bounded and short. */
  }
}

static void sensor_port_drive_low(void *context)
{
  GPIO_InitTypeDef gpio;

  (void)context;
  gpio.GPIO_Pin = GPIO_Pin_9;
  gpio.GPIO_Mode = GPIO_Mode_OUT;
  gpio.GPIO_Speed = GPIO_Speed_50MHz;
  gpio.GPIO_OType = GPIO_OType_PP;
  gpio.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOG, &gpio);
  GPIO_ResetBits(GPIOG, GPIO_Pin_9);
}

static void sensor_port_release_bus(void *context)
{
  GPIO_InitTypeDef gpio;

  (void)context;
  gpio.GPIO_Pin = GPIO_Pin_9;
  gpio.GPIO_Mode = GPIO_Mode_IN;
  gpio.GPIO_Speed = GPIO_Speed_50MHz;
  gpio.GPIO_OType = GPIO_OType_PP;
  gpio.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(GPIOG, &gpio);
}

static bool sensor_port_read_level(void *context)
{
  (void)context;
  return GPIO_ReadInputDataBit(GPIOG, GPIO_Pin_9) != Bit_RESET;
}

static const ds18b20_port_t g_sensor_port = {
  NULL,
  sensor_port_now_us,
  sensor_port_delay_us,
  sensor_port_drive_low,
  sensor_port_release_bus,
  sensor_port_read_level
};

static void sensor_gpio_init(void)
{
  GPIO_InitTypeDef gpio;

  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOG, ENABLE);
  gpio.GPIO_Mode = GPIO_Mode_IN;
  gpio.GPIO_Speed = GPIO_Speed_50MHz;
  gpio.GPIO_OType = GPIO_OType_PP;
  gpio.GPIO_PuPd = GPIO_PuPd_UP;
  gpio.GPIO_Pin = GPIO_Pin_9;
  GPIO_Init(GPIOG, &gpio);
}

void board_a_rtos_note_config_stack(uint32_t min_words)
{
  g_board_a_rtos_diag.config_stack_min_words = min_words;
}

void board_a_rtos_note_storage_stack(uint32_t min_words)
{
  g_board_a_rtos_diag.storage_stack_min_words = min_words;
}

static bool model_lock(void *context)
{
  (void)context;
  if (xSemaphoreTake(g_model_mutex, portMAX_DELAY) != pdTRUE) {
    return false;
  }
  g_model_lock_started_us = TIM2->CNT;
  return true;
}

static void model_unlock(void *context)
{
  uint32_t elapsed_us = (uint32_t)(TIM2->CNT - g_model_lock_started_us);

  (void)context;
  if (elapsed_us > g_board_a_rtos_diag.model_lock_max_us) {
    g_board_a_rtos_diag.model_lock_max_us = elapsed_us;
  }
  xSemaphoreGive(g_model_mutex);
}

static const board_a_runtime_ops_t g_runtime_ops = {
  model_lock,
  model_unlock,
  board_a_rtos_now_us
};

/*
 * Board A uses TIM2 for microsecond delays, not SysTick. The production
 * soft-I2C init runs before the scheduler, so report readiness from the
 * actual delay backend instead of the legacy SysTick check.
 */
bool soft_i2c_platform_ready(void)
{
  return ((RCC->APB1ENR & RCC_APB1ENR_TIM2EN) != 0U) &&
         ((TIM2->CR1 & TIM_CR1_CEN) != 0U);
}

static void rs485_init(void)
{
  GPIO_InitTypeDef gpio;
  USART_InitTypeDef usart;
  NVIC_InitTypeDef nvic;

  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA |
                         RCC_AHB1Periph_GPIOG, ENABLE);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);

  GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_USART2);
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_USART2);
  gpio.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3;
  gpio.GPIO_Mode = GPIO_Mode_AF;
  gpio.GPIO_Speed = GPIO_Speed_50MHz;
  gpio.GPIO_OType = GPIO_OType_PP;
  gpio.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(GPIOA, &gpio);

  gpio.GPIO_Pin = GPIO_Pin_8;
  gpio.GPIO_Mode = GPIO_Mode_OUT;
  gpio.GPIO_Speed = GPIO_Speed_50MHz;
  gpio.GPIO_OType = GPIO_OType_PP;
  gpio.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOG, &gpio);
  GPIO_ResetBits(GPIOG, GPIO_Pin_8);

  usart.USART_BaudRate = BOARD_A_RS485_BAUD;
  /*
   * STM32F4 parity occupies the ninth transmitted bit. The 8 data bits plus
   * even parity therefore require WordLength_9b in the peripheral config.
   */
  usart.USART_WordLength = USART_WordLength_9b;
  usart.USART_StopBits = USART_StopBits_1;
  usart.USART_Parity = USART_Parity_Even;
  usart.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  usart.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_Init(USART2, &usart);

  USART_ITConfig(USART2, USART_IT_RXNE, DISABLE);
  USART_ITConfig(USART2, USART_IT_ERR, DISABLE);
  USART_ITConfig(USART2, USART_IT_PE, DISABLE);
  USART_ITConfig(USART2, USART_IT_TXE, DISABLE);
  USART_ITConfig(USART2, USART_IT_TC, DISABLE);
  USART_ClearFlag(USART2, USART_FLAG_TC);

