kusadact/STM32-TriPhaseWatch/firmware/board_a/platform/board_a_rtos.c
  taskENTER_CRITICAL();
  empty = uxQueueMessagesWaiting(g_rx_queue) == 0U;
  if (empty) {
    *fault_epoch = g_rx_fault_epoch;
    *now_us = (uint32_t)board_a_rtos_now_us(NULL);
  }
  taskEXIT_CRITICAL();
  return empty;
}

static void process_rx_event(const board_a_rx_event_t *event)
{
  if (event->flags != 0U) {
    if (!board_a_rx_recovery_is_discarding(&g_rx_recovery)) {
      board_a_rx_recovery_begin(&g_rx_recovery, event->timestamp_us);
      modbus_rtu_rx_discard(&g_runtime.slave.receiver);
    }
    return;
  }

  if (!board_a_rx_recovery_accept(&g_rx_recovery, event->timestamp_us)) {
    return;
  }

  board_a_runtime_push_byte(&g_runtime, event->byte, event->timestamp_us);
}

static void debug_status(uint64_t now_us)
{
  board_a_runtime_status_t status;
  board_a_persistence_status_t persistence;

  if (!board_a_log_schedule_due(&g_log_schedule, now_us)) {
    return;
  }
  if (!board_a_runtime_copy_status(&g_runtime, &status)) {
    return;
  }
  if (!board_a_runtime_persistence_status(&g_runtime, &persistence)) {
    return;
  }

  debug_uart_puts("[board-a] run=");
  debug_write_u32(status.run_state);
  debug_uart_puts(" records=");
  debug_write_u32(status.sequence);
  debug_uart_puts(" rx=");
  debug_write_u32(status.stats.rx_frames);
  debug_uart_puts(" crc=");
  debug_write_u32(status.stats.crc_errors);
  debug_uart_puts(" tx=");
  debug_write_u32(status.stats.tx_responses);
  debug_uart_puts(" qdrop=");
  debug_write_u32(g_board_a_rtos_diag.rx_queue_drops);
  debug_uart_puts(" uerr=");
  debug_write_u32(g_board_a_rtos_diag.uart_error_flags);
  debug_uart_puts(" txto=");
  debug_write_u32(g_board_a_rtos_diag.tx_timeouts);
  debug_uart_puts(" gen=");
  debug_write_u32(persistence.generated);
  debug_uart_puts(" sync=");
  debug_write_u32(persistence.synced);
  debug_uart_puts(" drop=");
  debug_write_u32(persistence.dropped);
  debug_uart_puts(" q=");
  debug_write_u32(persistence.queued);
  debug_uart_puts(" st=");
  debug_write_u32(persistence.storage_state);
  debug_uart_puts(" stk=");
  debug_write_u32(g_board_a_rtos_diag.comm_stack_min_words);
  debug_uart_puts("/");
  debug_write_u32(g_board_a_rtos_diag.acquisition_stack_min_words);
  debug_uart_puts("/");
  debug_write_u32(g_board_a_rtos_diag.config_stack_min_words);
  debug_uart_puts("/");
  debug_write_u32(g_board_a_rtos_diag.storage_stack_min_words);
  debug_uart_puts("\r\n");
}

static void comm_task(void *argument)
{
  board_a_rx_event_t event;
  size_t response_length;
  uint32_t now_us;
  uint32_t poll_epoch;
  bool scheduling_state_changed;

  (void)argument;
  taskENTER_CRITICAL();
  g_board_a_rtos_diag.task_ready_mask |= 1U << 0;
  taskEXIT_CRITICAL();
  rs485_enable_rx_interrupt();

  for (;;) {
    UBaseType_t queue_depth;

    service_rx_fault();
    queue_depth = uxQueueMessagesWaiting(g_rx_queue);
    if (queue_depth > g_board_a_rtos_diag.rx_queue_depth_max) {
      g_board_a_rtos_diag.rx_queue_depth_max = queue_depth;
    }
    if (xQueueReceive(g_rx_queue, &event, pdMS_TO_TICKS(5)) == pdPASS) {
      do {
        process_rx_event(&event);
        service_rx_fault();
      } while (xQueueReceive(g_rx_queue, &event, 0U) == pdPASS);
      if (g_config_task != NULL) {
        xTaskNotifyGive(g_config_task);
      }
      if (g_storage_task != NULL) {
        xTaskNotifyGive(g_storage_task);
      }
      continue;
    }

    if (!rx_queue_empty_and_sample(&now_us, &poll_epoch)) {
      continue;
    }
    if ((g_rx_fault_epoch != g_rx_fault_epoch_seen) ||
        (g_rx_fault_epoch != poll_epoch)) {
      service_rx_fault();
      continue;
    }
    if (!board_a_rx_recovery_can_poll(&g_rx_recovery, now_us)) {
      continue;
    }

    response_length = board_a_runtime_poll_observe(
        &g_runtime, now_us, g_response, sizeof(g_response),
        &scheduling_state_changed);
    if (scheduling_state_changed) {
      xTaskNotifyGive(g_acquisition_task);
    }
    if (response_length != 0U) {
      (void)tx_send(g_response, (uint16_t)response_length);
    }
    debug_status(board_a_rtos_now_us(NULL));
    g_board_a_rtos_diag.comm_stack_min_words =
        uxTaskGetStackHighWaterMark(NULL);
  }
}

/*
 * The acquisition task waits for the earliest pending deadline: the next
 * periodic sample while running, or the latched scheduled-start deadline while
 * armed. The wait is capped at one second so the TIM2 monotonic service keeps
 * extending even when no deadline is near.
 */
static uint32_t acquisition_wait_ms(const board_a_runtime_status_t *status,
                                    uint64_t now_us,
                                    uint64_t sensor_scan_us)
{
  uint64_t earliest_us = 0U;
  uint64_t remaining_us;
  bool have_deadline = false;

  if (status->run_state == BOARD_A_RUN_RUNNING) {
    if (status->start_pending || (status->next_sample_us == 0U)) {
      return 0U;
    }
    earliest_us = status->next_sample_us;
    have_deadline = true;
  }

  if (status->schedule_armed &&
      (!have_deadline || (status->schedule_deadline_us < earliest_us))) {
    earliest_us = status->schedule_deadline_us;
    have_deadline = true;
  }
  if ((sensor_scan_us != 0U) &&
      (!have_deadline || (sensor_scan_us < earliest_us))) {
    earliest_us = sensor_scan_us;
    have_deadline = true;
  }

  if (!have_deadline) {
    return BOARD_A_MAX_WAIT_MS;
  }
  if (earliest_us <= now_us) {
    return 0U;
  }

  remaining_us = earliest_us - now_us;
  if (remaining_us > (uint64_t)BOARD_A_MAX_WAIT_MS * 1000ULL) {
    return BOARD_A_MAX_WAIT_MS;
  }
  return (uint32_t)((remaining_us + 999ULL) / 1000ULL);
}

static void sensor_scan_if_due(uint64_t now_us)
{
  board_a_runtime_status_t status;
  board_a_sensor_snapshot_t snapshot;
  board_a_sensor_map_t runtime_map;
  board_a_sensor_map_t manager_map;

  if (!board_a_runtime_copy_status(&g_runtime, &status) ||
      (status.data_source != BOARD_A_DATA_SOURCE_REAL_DS18B20)) {
    return;
  }
  if (board_a_runtime_copy_sensor_map(&g_runtime, &runtime_map) &&
      (runtime_map.valid_mask != 0U) &&
      board_a_sensor_manager_copy_map(&g_sensor_manager, &manager_map) &&
      (manager_map.valid_mask == 0U)) {
    (void)board_a_sensor_manager_set_map(&g_sensor_manager, &runtime_map);
  }
  if (board_a_sensor_manager_step(&g_sensor_manager, now_us, &snapshot)) {
    board_a_runtime_publish_sensor_snapshot(&g_runtime, &snapshot);
  }
  if (board_a_sensor_manager_take_map_dirty(&g_sensor_manager) &&
      board_a_sensor_manager_copy_map(&g_sensor_manager, &manager_map)) {
    (void)board_a_runtime_publish_sensor_map(&g_runtime, &manager_map);
    if (!board_a_runtime_request_sensor_map_save(
            &g_runtime, (uint32_t)(now_us ^ (now_us >> 32U)))) {
      board_a_sensor_manager_mark_map_dirty(&g_sensor_manager);
    } else if (g_config_task != NULL) {
      xTaskNotifyGive(g_config_task);
    }
  }
}

static void acquisition_task(void *argument)
{
  board_a_runtime_status_t status;
  uint32_t wait_ms;
  uint32_t notification_value;

  (void)argument;
  taskENTER_CRITICAL();
  g_board_a_rtos_diag.task_ready_mask |= 1U << 1;
  taskEXIT_CRITICAL();

