kusadact/STM32-TriPhaseWatch/firmware/board_a/platform/board_a_rtos.c
  for (;;) {
    uint64_t now_us = board_a_rtos_now_us(NULL);
    board_a_runtime_status_t before_tick;

    /*
     * A due sensor scan runs before the scheduler tick so a new record uses
     * the latest complete DS18B20 snapshot. The record period remains anchored
     * to the model's planned deadline; this bounded scan only affects the
     * actual completion time.
     */
    sensor_scan_if_due(now_us);
    now_us = board_a_rtos_now_us(NULL);

    if (board_a_runtime_copy_status(&g_runtime, &before_tick) &&
        (before_tick.run_state == BOARD_A_RUN_RUNNING) &&
        !before_tick.start_pending &&
        (before_tick.next_sample_us != 0U) &&
        (now_us >= before_tick.next_sample_us)) {
      uint32_t late_us =
          (uint32_t)(now_us - before_tick.next_sample_us);

      if (late_us > g_board_a_rtos_diag.schedule_late_max_us) {
        g_board_a_rtos_diag.schedule_late_max_us = late_us;
      }
    }

    board_a_runtime_tick(&g_runtime, now_us);
    if (g_storage_task != NULL) {
      xTaskNotifyGive(g_storage_task);
    }
    if (!board_a_runtime_copy_status(&g_runtime, &status)) {
      wait_ms = BOARD_A_MAX_WAIT_MS;
    } else {
      uint64_t sensor_scan_us =
          (status.data_source == BOARD_A_DATA_SOURCE_REAL_DS18B20) ?
          board_a_sensor_manager_next_step_us(&g_sensor_manager) : 0U;

      if (status.schedule_start_late_us >
          g_board_a_rtos_diag.schedule_start_late_max_us) {
        g_board_a_rtos_diag.schedule_start_late_max_us =
            status.schedule_start_late_us;
      }
      g_board_a_rtos_diag.schedule_start_count =
          status.schedule_start_count;
      wait_ms = acquisition_wait_ms(&status, now_us, sensor_scan_us);
    }

    (void)xTaskNotifyWait(0U, 0xFFFFFFFFUL, &notification_value,
                          pdMS_TO_TICKS(wait_ms));
    (void)notification_value;
    taskENTER_CRITICAL();
    g_board_a_rtos_diag.acquisition_stack_min_words =
        uxTaskGetStackHighWaterMark(NULL);
    taskEXIT_CRITICAL();
  }
}

static void create_runtime_objects(void)
{
  g_model_mutex = xSemaphoreCreateMutexStatic(&g_model_mutex_buffer);
  g_rx_queue = xQueueCreateStatic(BOARD_A_RX_QUEUE_CAPACITY,
                                  sizeof(board_a_rx_event_t),
                                  (uint8_t *)g_rx_queue_storage,
                                  &g_rx_queue_buffer);
  if ((g_model_mutex == NULL) || (g_rx_queue == NULL)) {
    board_a_rtos_fatal(BOARD_A_FAULT_TASK_CREATE);
  }

  board_a_runtime_init(&g_runtime, 1U, &g_runtime_ops, NULL);
  (void)board_a_runtime_set_data_source(
      &g_runtime, BOARD_A_DATA_SOURCE_REAL_DS18B20);

  g_comm_task = xTaskCreateStatic(
      comm_task, "comm", BOARD_A_COMM_STACK_WORDS, NULL,
      BOARD_A_COMM_TASK_PRIORITY, g_comm_stack, &g_comm_task_buffer);
  g_acquisition_task = xTaskCreateStatic(
      acquisition_task, "acq", BOARD_A_ACQUISITION_STACK_WORDS, NULL,
      BOARD_A_ACQUISITION_TASK_PRIORITY, g_acquisition_stack,
      &g_acquisition_task_buffer);
  g_config_task = xTaskCreateStatic(
      board_a_config_task, "config", BOARD_A_CONFIG_STACK_WORDS, &g_runtime,
      1U, g_config_stack, &g_config_task_buffer);
  g_storage_task = xTaskCreateStatic(
      board_a_storage_task, "storage", BOARD_A_STORAGE_STACK_WORDS,
      &g_runtime, 1U, g_storage_stack, &g_storage_task_buffer);
  if ((g_comm_task == NULL) || (g_acquisition_task == NULL) ||
      (g_config_task == NULL) || (g_storage_task == NULL)) {
    board_a_rtos_fatal(BOARD_A_FAULT_TASK_CREATE);
  }

  g_board_a_rtos_diag.rx_queue_item_size = sizeof(board_a_rx_event_t);
}

int board_a_rtos_run(void)
{
  timer_init();
  debug_uart_init(DEBUG_UART_BAUD);
  debug_uart_puts("\r\n[board-a] Modbus RTU slave / FreeRTOS\r\n");
  debug_uart_puts("[board-a] addr=1 uart=USART2 PA2/PA3 PG8 9600 8E1\r\n");
  debug_uart_puts("[board-a] debug=USART1 PA9/PA10 115200 8N1\r\n");
  debug_uart_puts("[board-a] ds18b20=PG9 shared 1-Wire, 1s scan\r\n");

  board_a_tx_init(&g_tx);
  board_a_rx_recovery_init(&g_rx_recovery, BOARD_A_T35_US);
  board_a_log_schedule_init(&g_log_schedule, BOARD_A_LOG_PERIOD_US, 0U);
  delay_init(168U);
  sensor_gpio_init();
  board_a_sensor_manager_init(&g_sensor_manager, &g_sensor_port);
  create_runtime_objects();
  rs485_init();
  board_a_persistence_startup(&g_runtime);

  debug_uart_puts("[board-a] scheduler starting\r\n");
  vTaskStartScheduler();

  board_a_rtos_fatal(BOARD_A_FAULT_SCHEDULER_RETURNED);
  return 0;
}
